Revit 2027 API
IRebarUpdateServer.GetCustomHandles Method
 This function should define all handles that the Rebar has.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool GetCustomHandles(
	RebarHandlesData handlesInfoData
)
Function GetCustomHandles (
	handlesInfoData As RebarHandlesData
) As Boolean
bool GetCustomHandles(
	RebarHandlesData^ handlesInfoData
)
abstract GetCustomHandles :
        handlesInfoData : RebarHandlesData -> bool
Parameters
handlesInfoData RebarHandlesData
 Use the methods on this class to define the handles for the free form rebar. Revit will use these handles to create appropriate RebarConstraints.
Return Value
Boolean
 Returns true if the handles were defined successfully, false otherwise.
Remarks
 Revit consider the execution failed if we have duplicate tags for custom, start and end handles. Document should not be modified during the execution of this function.
See Also
Reference
IRebarUpdateServer Interface
Autodesk.Revit.DB.Structure Namespace